Repository: jbcooley/Npgsql2
Catalog: Npgsql/Localization/L10N.*.resx
Languages: de, es, fi, ja, zh_cn

# CommandTimeoutLessZero
source: CommandTimeout can't be less than zero.
de: Der CommandTimeout kann nicht kleiner als null sein.
es: CommandTimeout no puede ser menor que cero.
fi: CommandTimeout ei voi olla pienempi kuin nolla.
ja: コマンドタイムアウトはゼロ以下に設定できません.
zh_cn: CommandTimeout不能为负值。

# SetConnectionInTransaction
source: The Connection property can't be changed with an uncommited transaction.
de: Die Eigenschaft Connection kann nicht während einer Transaktion geändert werden.
es: La propiedad Connection no puede ser cambiada por una transaccion incompleta (uncommited).
fi: Connection-ominaisuutta ei voi muuttaa kesken transaktion.
ja: 接続・プロパティは、トランザクションのコミット前に変更でききません.
zh_cn: 事务提交前，无法改变连接属性。

# SetTransactionInTransaction
source: The Transaction property can't be changed with an uncommited transaction.
de: Die Eigenschaft Transaction kann nicht während einer Transaktion geändert werden.
es: La propiedad Transaction no puede ser cambiada por una transaccion incompleta (uncommited).
fi: Transaction-ominaisuutta ei voi muuttaa kesken transaktion.
ja: トランザクション・プロパティは、トランザクションのコミット前に変更でききません.
zh_cn: 事务提交前，无法改变事务属性。

# CommandTypeTableDirect
source: Only Text and StoredProcedure types supported!
de: Es werden nur die Typen Text und StoredProcedure unterstützt!
es: ¡Unicamente los tipos Text y StoredProcedure son soportados!
fi: Vain 'Text' ja 'StoredProcedure'-tyypit ovat tuettuja!
ja: テキストのみのストアドプロシジャ・タイプはサポートされます!
zh_cn: 只支持Text和StoredProcedure类型。

# BackendErrors
source: There have been errors reported by the backend.
ja: バックエンドによって報告されたエラーがあります.
zh_cn: 服务端发来错误报告。

# MediatorErrors
source: There have been errors on {0}():
de: Beim Aufruf von {0}() sind Fehler aufgetreten:
es: Han ocurrido errores en {0}():
fi: Virheitä kutsussa {0}():
ja: {0}() に間違いがあります:
zh_cn: {0}() 处出错:

# MediatorErrors_1P
source: There have been errors on {0}({1}):
de: Beim Aufruf von {0}({1}) sind Fehler aufgetreten:
es: Han ocurrido errores en {0}():
fi: Virheitä kutsussa {0}({1}):
ja: {0}({1}) に間違いがあります:
zh_cn: {0}({1}) 处出错:

# ConnectionNull
source: The Connection is not set.
de: Die Eigenschaft "Connection" muss gesetzt sein.
es: La conexión no está establecida.
fi: Connection-ominaisuutta ei ole asetettu.
ja: 接続は設定されません.
zh_cn: 连接尚未设定。

# ConnectionNotOpen
source: The Connection is not open.
de: Die Verbindung ist nicht offen.
es: La conexión no está abierta.
fi: Connection ei ole auki.
ja: 接続は開いていません.
zh_cn: 连接未打开。

# ParamNotInQuery
source: Parameter {0} not found in query.
de: Der Parameter {0} konnte im SQL-Statement nicht gefunden werden.
es: El parámetro {0} no fue encontrado en la consulta.
fi: Parametria {0} ei löytynyt kyselyssä.
ja: パラメーター {0} は、クエリで見つけられません.
zh_cn: 参数 {0} 没有出现在查询中。

# ConnectionBroken
source: The Connection is broken.
ja: 接続は壊れます。
zh_cn: 连接已中断。

# ConnectionStringDescription
source: Information used to connect to a PostgreSQL Database, such as 'Server=X;Port=X;Database=X;User Id=X;Password=X;'
de: Informationen zum Verbinden mit einer PostgreSQL Datenbank, z.B.: 'Server=X;Port=X;Database=X;User Id=X;Password=X;'
es: La información utilizada para conectarse a una Base de Datos de PostgreSQL, es como sigue 'Server=X;Port=X;Database=X;User Id=X;Password=X;'
fi: PostgreSQL-tietokantaan liittymiseen tarvittava tieto, esim. 'Server=X;Port=X;Database=X;User Id=X;Password=X;'
ja: PostgreSQLデータベースに接続するために使用される情報, 例 'Server=X;Port=X;Database=X;User Id=X;Password=X;'
zh_cn: 用于连接PostgreSQL数据库的信息，例: 'Server=X;Port=X;Database=X;User Id=X;Password=X;'

# ConnectionTimeoutDescription
source: Current connection timeout value, 'Connect Timeout=X' in the connection string
de: Aktueller Verbindungstimeout-Wert, 'Connect Timeout=X' im ConnectionString
es: El valor actual de connection timeout, 'Connect Timeout=X' en la cadena de conexión
fi: Tämänhetkinen yhteyden aikakatkaisu, 'Connect Timeout=X' liittymistiedoissa
ja: 接続タイムアウト値は, 'Connect Timeout=X'
zh_cn: 连接等待超时值，连接字符串中为'Connect Timeout=X'

# DatabaseDescription
source: Database
de: Aktuelle PostgreSQL Datenbank, 'Database=X' im ConnectionString
es: La Base de Datos PostgreSQL actual, 'Database=X' en la cadena de conexión
fi: Tämänhetkinen PostgreSQL-tietokanta, 'Database=X' liittymistiedoissa
ja: PostgreSQLデータベース接続文字列は, 'Database=X'
zh_cn: 所连接的PostgreSQL数据库，连接字符串中为'Database=X'

# NoNestedTransactions
source: Nested/Concurrent transactions aren't supported.
de: Verschachtelte/gleichzeitige Transaktionen werden nicht unterstützt.
es: Las transacciones concurrentes y anidades no son soportadas.
fi: Sisäkkäisiä/yhtäaikaisia transaktioita ei tueta.
ja: トランザクションのネスト/複合はサポートされていません.
zh_cn: 不支持嵌套/并发事务。

# InvalidDbName
source: Invalid database name: {0}
de: Ungültiger Datenbankname: {0}
es: Nombre de Base de Datos inválido: {0}
fi: Kelpaamaton tietokantanimi: {0}
ja: データベース名: {0} は間違っています
zh_cn: 错误的数据库名: {0}

# MissingConnStrArg
source: Connection string argument missing!
de: Es fehlt ein Argument des ConnectionString!
es: ¡Falta un argumento en la cadena de conexión!
fi: Liittymistiedoista puuttuu argumentti!
ja: 接続文字列に誤りがあります!
zh_cn: 连接字符串中有遗漏的参数!

# ConnOpen
source: Connection already open
de: Die Verbindung ist bereits offen
es: La conexión está abierta actualmente
fi: Yhteys jo auki
ja: 接続はすでにオープンされています
zh_cn: 连接已经是打开状态了

# ConnNotOpen
source: Connection is not open
ja: 接続のオープンができません
zh_cn: 连接未打开

# ConnStrEmpty
source: ConnectionString cannot be empty.
de: Der ConnectionString kann nicht leer sein.
es: ConnectionString no puede estar vacia.
fi: Liittymistieto ei voi olla tyhjä.
ja: 接続文字列の指定がありません.
zh_cn: 连接字符串不能为空。

# SocketEx
source: A SocketException occured
de: Es ist ein Socket-Fehler aufgetreten
es: ocurrió una excepción SocketException
fi: SocketException ilmeni
ja: SocketException が発生しました
zh_cn: 有SocketException异常

# OpenError
source: There have been errors on Open()
de: Beim Aufruf von Open() sind Fehler aufgetreten
es: Han ocurrido errores en Open()
fi: Virheitä Open()-kutsussa
ja: Open() の最中にエラーが発生しました
zh_cn: Open()时发生错误

# CloseError
source: Error in Close()
de: Beim Aufruf von Close() sind Fehler aufgetreten
es: Error en Close()
fi: Virhe Close()-kutsussa
ja: Close() でエラーが発生しました
zh_cn: Close()时发生错误

# WrongKeyVal
source: key=value argument incorrect in ConnectionString
de: Schlüssel=Wert Argument is falsch in der Verbindungszeichenfolge
ja: ConnectionStringで不正確なキーワード=値です。
zh_cn: ConnectionString中的 key=value 参数不正确

# InvalidBooleanKeyVal
source: expecting {0}=[True/False] value in ConnectionString
de: erwarte {0}=[True/False] Wert in der Verbindungszeichenfolge
ja: ConnectionStringで {0}=[True/False] 値の評価を期待します
zh_cn: 期望 ConnectionString 中的 {0}=[True/False]

# InvalidIntegerKeyVal
source: expecting {0}=[Numeric] value in ConnectionString
de: erwarte {0}=[Numeric] Wert in der Verbindungszeichenfolge
ja: ConnectionStringで {0}=[Numeric] 値の評価を期待します
zh_cn: 期望 ConnectionString 中的 {0}=[Numeric]

# IntegerKeyValMax
source: numeric value {0} in ConnectionString exceeds maximum value {1}
de: Numerischer Wert {0} in der Verbindungszeichenfolge übersteigt den maximalen Wert {1}
ja: ConnectionStringの数値 {0} は、最大値 {1} を超えます
zh_cn: ConnectionString 中的数值 {0} 超过了最大值 {1}

# IntegerKeyValMin
source: numeric value {0} in ConnectionString is below minimum value {1}
de: Numerischer Wert {0} in der Verbindungszeichenfolge unerschreitet den minimalen Wert {1}
ja: ConnectionStringの数値 {0} は、最小値 {1} を下回ります
zh_cn: ConnectionString 中的数值 {0} 低于最大值 {1}

# InvalidProtocolVersionKeyVal
source: expecting {0}=[Protocol Version] value in ConnectionString
de: erwarte {0}=[Protocol Version] Wert in der Verbindungszeichenfolge
ja: ConnectionStringで {0}=[Protocol Version] 値の評価を期待します
zh_cn: 期望 ConnectionString 中的 {0}=[Protocol Version]

# AuthenticationMethodNotSupported
source: Only AuthenticationClearTextPassword and AuthenticationMD5Password supported for now. Received: {0}
de: Nur Klartext-Passwort-Authentifizierung und MD5-Passwort-Authentifizierung werden derzeit unterstützt. Empfangen: {0}
ja: 単に、AuthenticationClearTextPassword と AuthenticationMD5Password はサポートされます。 {0} を受け付けます。

# SslRequestError
source: Ssl connection requested. No Ssl enabled connection from this host is configured.
de: SSL-Verbindung wurde angefordert. SSL ist für diesen Host nicht konfiguriert.
ja: SSL接続を要求しました。対象のホストはSSL接続で構成されていません。

# ConnectionTimeout
source: Connection establishment timeout. Increase Timeout value in ConnectionString.
de: Verbindungsversuch erzeugte eine Zeitüberschreitung. Timeout-Wert in der Verbindungszeichenfolge erhöhen.
ja: 接続確立時にタイムアウトしました。ConnectionStringでタイムアウトの値を増やして下さい。

# FailedConnection
source: Failed to establish a connection to '{0}'.
de: Verbindung zu '{0}' konnte nicht hergestellt werden.
ja: '{0}' へ接続の確立に失敗しました。

# ImpossibleToCast
source: Can't cast {0} into any valid DbType.
de: Der Typ {0} kann nicht in einen gültigen DbType umgewandelt werden.
es: No es posible convertir {0} en un DbType válido.
fi: Ei voi muuntaa arvoa {0} miksikään DbType:ksi.
ja: {0}は、どのようなDbTypeにも割り当てることができません.

# WrongType
source: Can't cast {0} into NpgsqlParameter
de: Kann {0} nicht in ein Objekt vom Typ NpgsqlParameter umwandeln!
es: No es posible convertir {0} a un NpgsqlParameter
fi: Ei voi muuttaa arvoa {0} NpgsqlParameter-tyypiksi
ja: NpgsqlParameterへ {0} を割り当てることができません

# InvalidParameterName
source: Invalid parameter name: {0}
ja: 無効なパラメーター名: {0}

# NoTransaction
source: No transaction in progress.
ja: 処理中のトランザクションはありません.

# InvalidFunctionName
source: {0} does not exist in pg_proc
de: {0} existiert nicht in pg_proc
zh_cn: pg_proc 中不存在 {0}

# RowSequentialFieldError
source: Invalid attempt to read from column ordinal '{0}'. With CommandBehavior.SequentialAccess, you may only read from column ordinal '{1}' or greater.
de: Ungültiger Versuch von Spalten-Nummer '{0}' zu lesen. Mit CommandBehavior.SequentialAccess, können Sie nur von Spalten-Nummer'{1}' oder höher lesen.

# ReadOnlyWriteError
source: The collection is read-only
de: Die Collection ist "read-only"
